/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minell <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/09 18:01:00 by minell            #+#    #+#             */
/*   Updated: 2021/10/09 18:01:09 by minell           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/**
 * bzero устанавливает первые n байтов области,
 * начинающейся с s в нули (пустые байты). 
 */
void	ft_bzero(void *s, size_t n)
{
	size_t	i;

	i = 0;
	while (n != 0)
	{
		((char *)s)[i] = '\0';
		i++;
		n--;
	}
}
