/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minell <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/28 13:56:32 by minell            #+#    #+#             */
/*   Updated: 2021/10/28 13:56:35 by minell           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/**
 * добавляет элемент new в начало списка.
*/
void	ft_lstadd_front(t_list **lst, t_list *new)
{
	t_list	*begin;

	begin = new;
	begin->next = *lst;
	*lst = begin;
}
