/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: minell <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/05 16:39:46 by minell            #+#    #+#             */
/*   Updated: 2021/10/09 18:07:40 by minell           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/**
 * ищет символ с в строке возвращает указатель на искомый символ.
 */
char	*ft_strchr(const char *str, int c)
{
	char	*temp;

	temp = (char *) str;
	while (*temp)
	{
		if (*temp == (char)c)
			return (temp);
		temp++;
	}
	if ((char)c == *temp)
		return (temp);
	return (0);
}
